{
    "lógica de programação": [
        {
            "titulo": "1.0 O que é programação básica",
            "conteudo": "Definição: Programar é escrever instruções que um computador pode\nentender e executar. Essas instruções são chamadas de código.\nAnalogia simples: Programar é como escrever uma receita de bolo.\nVocê diz passo a passo o que deve ser feito, e o computador executa\nexatamente como foi escrito."
        },
        {
            "titulo": "2.0 Lógica da programação",
            "conteudo": "Antes de aprender uma linguagem de programação, é importante\nentender lógica.\nConceitos básicos:\nSequência: execução passo a passo.\nDecisão (condicional): escolha de caminhos (ex: “se chover,\nleve o guarda-chuva”).\nRepetição (laços): repetir ações (ex: “enquanto tiver louça,\ncontinue lavando”)."
        },
        {
            "titulo": "2.1 Exemplo em pseudocódigo",
            "conteudo": "se idade >= 18 então\nescreva('Você é maior de idade.')\nsenão\nescreva('Você é menor de idade.')\nfim"
        },
        {
            "titulo": "3.0 Primeiros passos com uma linguagem",
            "conteudo": "Linguagem recomendada: Python\nPor que Python?\nSintaxe simples (parece português)\nMuito usada no mercado\nFácil de instalar e testar"
        },
        {
            "titulo": "3.1 Primeiro programa",
            "conteudo": "python\nprint('Olá, mundo!')"
        },
        {
            "titulo": "3.2 Conteúdo iniciais",
            "conteudo": "Variáveis: armazenam dados.\npython\nnome = 'João'\nidade = 20"
        },
        {
            "titulo": "3.3 Entrada e saída",
            "conteudo": "nome = input('Qual é o seu nome? ')\nprint('Olá,', nome)"
        },
        {
            "titulo": "3.4 Condicionais",
            "conteudo": "python\nidade = int(input('Digite sua idade: '))\nif idade >= 18:\nprint('Você pode entrar.')\nelse:\nprint('Você não pode entrar.')"
        },
        {
            "titulo": "3.5 Laços de repetição",
            "conteudo": "python\nfor i in range(5):\nprint('Número', i)"
        },
        {
            "titulo": "4.0 Estrutura de dados simples",
            "conteudo": "Listas: coleções de dados.\npython\nfrutas = ['maça', 'banana', 'uva']\nprint(frutas[1])  # banana"
        },
        {
            "titulo": "Dicionários",
            "conteudo": "Dicionários: pares chave-valor.\npython\npessoa = {'Nome': 'Ana', 'idade': 22}\nprint(pessoa['nome'])  # Ana"
        }
    ],
    "tecnologia da informação e comunicação": [
        {
            "titulo": "1.0 O que é Tecnologia da Informação?",
            "conteudo": "Tecnologia da Informação, ou TI, é o uso de computadores, internet,\nsistemas e softwares para guardar, organizar, proteger e transmitir\ninformações.\nEm outras palavras, TI é tudo que envolve informação e tecnologia\njuntas para ajudar pessoas e empresas no dia a dia."
        },
        {
            "titulo": "2.0 Para que serve a Tecnologia da Informação?",
            "conteudo": "A TI está presente em quase tudo hoje em dia:\n- Quando você usa o celular ou acessa a internet;\n- Quando uma loja controla seu estoque pelo computador;\n- Quando um hospital salva o prontuário de um paciente;\n- Quando uma escola usa sistemas para ensinar a distância.\nOu seja, TI ajuda a facilitar o trabalho, melhorar a comunicação\ne organizar dados com segurança."
        },
        {
            "titulo": "3.0 Áreas importantes dentro da TI",
            "conteudo": "Abaixo estão as áreas mais comuns da Tecnologia da Informação:\n1. Suporte Técnico   =   Ajuda as pessoas a resolver problemas\ncom computadores, redes e programas.\n2. Desenvolvimento de Software   =   Criação de sites, aplicativos,\njogos e sistemas.\n3. Redes de Computadores =   Conexão entre vários computadores\npara que compartilhem arquivos e internet.\n4. Segurança da Informação   =   Protege os dados contra roubo,\ninvasões e perda.\n5. Banco de Dados    =   Organiza e guarda grandes quantidades\nde informações de forma segura.\n6. Inteligência Artificial (IA) e Big Data   =   Usa máquinas\npara tomar decisões e analisar muitos dados de uma vez."
        },
        {
            "titulo": "4.0 Conclusão final",
            "conteudo": "Vivemos em um mundo cada vez mais conectado, onde a tecnologia\nestá presente em praticamente tudo o que fazemos —\ndesde a hora em que acordamos com o alarme do celular até quando\nassistimos a um vídeo, compramos pela internet ou acessamos uma\nrede social. Por trás de tudo isso, está a Tecnologia da Informação,\numa área que combina conhecimento técnico, inovação e criatividade\npara transformar o modo como vivemos, estudamos e trabalhamos."
        }
    ],
    "segurança digital": [
        {
            "titulo": "3.0 Segurança Digital",
            "conteudo": "A segurança digital é um conjunto de práticas, tecnologias e\nestratégias projetadas para proteger sistemas de computador, redes\ne dados digitais contra acesso não autorizado, danos, roubo ou\ninterrupção. Em outras palavras, trata-se de manter suas\ninformações digitais seguras e privadas."
        },
        {
            "titulo": "3.1 Por que a segurança digital é importante?",
            "conteudo": "A segurança digital é importante porque ajuda a proteger a\nprivacidade de indivíduos e organizações, salvaguardando\ninformações pessoais e confidenciais. Ela também ajuda a garantir\na continuidade dos negócios, prevenindo interrupções causadas por\nataques cibernéticos e protegendo a reputação de empresas e pessoas."
        },
        {
            "titulo": "3.2 Principais ameaças à segurança digital",
            "conteudo": "Existem várias ameaças à segurança digital, incluindo:\n- Malware: Softwares maliciosos, como vírus, worms, trojans e\nransomware, projetados para danificar ou roubar dados, ou\ncontrolar sistemas.\n- Phishing: Tentativas de enganar usuários para que revelem\ninformações confidenciais, como senhas e números de cartão de\ncrédito, geralmente por meio de e-mails ou mensagens falsas.\n- Ataques de negação de serviço (DoS): Ataques que visam tornar\num sistema ou serviço inacessível aos usuários legítimos,\nsobrecarregando-o com tráfego.\n- Injeção de SQL: Ataques que exploram vulnerabilidades em bancos\nde dados para inserir código malicioso, permitindo acesso não\nautorizado ou manipulação de dados.\n- Ataques de força bruta: Tentativas repetidas de adivinhar senhas\nou chaves de criptografia até encontrar a correta."
        },
        {
            "titulo": "3.3 Princípios da segurança digital",
            "conteudo": "Existem alguns princípios fundamentais que orientam as práticas\nde segurança digital, conhecidos como Tríade CIA (Confidencialidade,\nIntegridade e Disponibilidade), e outros adicionais:\n- Confidencialidade: Garantir que apenas pessoas autorizadas tenham\nacesso à informação.\n- Integridade: Garantir que as informações não sejam alteradas ou\ndestruídas de forma não autorizada, mantendo sua precisão e\nconfiabilidade.\n- Disponibilidade: Garantir que os sistemas e informações estejam\nacessíveis e utilizáveis por usuários autorizados sempre que\nnecessário.\n- Autenticidade: Garantir a identidade de usuários, dispositivos\ne sistemas.\n- Não repúdio: Garantir que as ações realizadas por um usuário não\npossam ser negadas posteriormente, provendo prova de origem\ne integridade dos dados."
        },
        {
            "titulo": "3.4 Melhores práticas de segurança digital",
            "conteudo": "Existem várias melhores práticas que os usuários e organizações\npodem adotar para melhorar sua segurança digital:\n- Usar senhas fortes e exclusivas: As senhas devem ser longas,\ncomplexas (combinando letras maiúsculas e minúsculas, números\ne símbolos) e diferentes para cada conta.\n- Habilitar a autenticação de dois fatores (2FA): Adicionar uma\ncamada extra de segurança, exigindo uma segunda forma de\nverificação (como um código enviado para o celular) além da senha.\n- Manter o software atualizado: Instalar as atualizações de\nsegurança para sistemas operacionais, navegadores e aplicativos,\npois elas corrigem vulnerabilidades conhecidas.\n- Ter cuidado com e-mails e links suspeitos: Não clicar em links\ndesconhecidos, não abrir anexos de remetentes não confiáveis e\nverificar a autenticidade de e-mails antes de interagir.\n- Usar um software antivírus e firewall: Instalar e manter\natualizado um programa antivírus e um firewall para proteger\ncontra malware e monitorar o tráfego de rede.\n- Fazer backup dos dados regularmente: Criar cópias de segurança\nde arquivos importantes e armazená-las em um local seguro e\nseparado, para recuperação em caso de perda de dados.\n- Educar os usuários sobre segurança digital: Fornecer treinamento\ne conscientização sobre as ameaças cibernéticas e as melhores\npráticas de segurança para todos os usuários."
        },
        {
            "titulo": "3.5 Conclusão",
            "conteudo": "A segurança digital é uma preocupação crescente no mundo digital,\ne a proteção de dados e sistemas é fundamental. É importante que\nos usuários e organizações adotem medidas proativas e sigam as\nmelhores práticas de segurança para se protegerem contra as\nameaças cibernéticas em constante evolução. Ao seguir as melhores\npráticas de segurança digital, é possível reduzir significativamente\nos riscos e construir um ambiente digital mais seguro."
        }
    ]
}