[
    {
        "lógica de programação": [
            {
                "pergunta": "Qual das alternativas define corretamente o conceito de programação básica?\na) Escrever textos em um editor de texto.\nb) Criar desenhos artísticos no computador.\nc) Escrever instruções que um computador pode entender e executar.\nd) Navegar na internet e acessar sites.",
                "correta": "c"
            },
            {
                "pergunta": "Qual dos seguintes elementos é fundamental para controlar o fluxo de execução de um programa, permitindo que ele tome decisões?\na) Variáveis\nb) Condicionais\nc) Listas\nd) Funções",
                "correta": "b"
            },
            {
                "pergunta": "Em Python, qual função é usada para exibir algo na tela?\na) input()\nb) print()\nc) len()\nd) range()",
                "correta": "b"
            },
            {
                "pergunta": "Qual estrutura de dados em Python é usada para armazenar uma coleção ordenada de itens?\na) Dicionário\nb) Tupla\nc) Lista\nd) Conjunto",
                "correta": "c"
            }
        ]
    },
    {
        "tecnologia da informação e comunicação": [
            {
                "pergunta": "Qual das alternativas melhor descreve o que é Tecnologia da Informação (TI)?\na) O uso de papel e caneta para registrar informações.\nb) O estudo de fenômenos naturais.\nc) O uso de computadores, internet, sistemas e softwares para gerenciar informações.\nd) A criação de obras de arte digitais.",
                "correta": "c"
            },
            {
                "pergunta": "Em quais áreas do nosso dia a dia a Tecnologia da Informação (TI) está presente?\na) Apenas em empresas de tecnologia.\nb) Apenas em hospitais e escolas.\nc) Em quase tudo, desde o uso do celular até o controle de estoque de uma loja.\nd) Em nenhuma, a TI é uma área do passado.",
                "correta": "c"
            },
            {
                "pergunta": "Qual área da TI é responsável por proteger dados contra roubo, invasões e perda?\na) Redes de Computadores\nb) Banco de Dados\nc) Segurança da Informação\nd) Inteligência Artificial",
                "correta": "c"
            },
            {
                "pergunta": "Qual o papel da Tecnologia da Informação (TI) na transformação do modo como vivemos e trabalhamos?\na) Não tem papel relevante, pois a sociedade continua a mesma.\nb) Transforma a forma como nos comunicamos, acessamos informações, trabalhamos e nos divertimos.\nc) Se limita a automatizar tarefas repetitivas em fábricas.\nd) Serve apenas para criar entretenimento digital, sem impacto em outras áreas.",
                "correta": "b"
            }
        ]
    },
    {
        "segurança digital": [
            {
                "pergunta": "Qual das alternativas define corretamente o conceito de segurança digital?\na) O uso de redes sociais para comunicação.\nb) A prática de tirar fotos com câmeras digitais.\nc) O conjunto de práticas, tecnologias e processos para proteger sistemas e dados.\nd) A instalação de jogos em um computador.",
                "correta": "c"
            },
            {
                "pergunta": "Qual dos seguintes NÃO é um princípio fundamental da segurança digital?\na) Confidencialidade\nb) Integridade\nc) Disponibilidade\nd) Velocidade de Processamento",
                "correta": "d"
            },
            {
                "pergunta": "Qual tipo de ameaça digital envolve tentativas de enganar usuários para obter informações confidenciais?\na) Malware\nb) Phishing\nc) Ataque de negação de serviço (DoS)\nd) Injeção de SQL",
                "correta": "b"
            },
            {
                "pergunta": "Qual das alternativas é uma melhor prática para aumentar a segurança digital?\na) Usar a mesma senha para todas as contas online.\nb) Clicar em links suspeitos de remetentes desconhecidos.\nc) Manter o software atualizado com as últimas atualizações de segurança.\nd) Desativar o firewall do computador para melhorar a velocidade da internet.",
                "correta": "c"
            }
        ]
    }
]